#include"ds1302.h"

//---DS1302Ð´ÈëºÍ¶ÁÈ¡Ê±·ÖÃëµÄµØÖ·ÃüÁî---//
//---Ãë·ÖÊ±ÈÕÔÂÖÜÄê ×îµÍÎ»¶ÁÐ´Î»;-------//
uchar code READ_RTC_ADDR[7] = {0x81, 0x83, 0x85, 0x87, 0x89, 0x8b, 0x8d}; 
uchar code WRITE_RTC_ADDR[7] = {0x80, 0x82, 0x84, 0x86, 0x88, 0x8a, 0x8c};
// ¶Á               Ð´
// 80£º1 0 00000 0£¬81£º1 0 00000 1
// 82£º1 0 00001 0, 83£º1 0 00001 1
// 84£º1 0 00010 0, 84£º1 0 00010 1,
// 86£º1 0 00011 0, 86£º1 0 00011 1,
// 88£º1 0 00100 0, 88£º1 0 00100 1,
// 8a£º1 0 00101 0, 8a£º1 0 00101 1,
// 8c£º1 0 00110 0, 8c£º1 0 00110 1,

//---DS1302Ê±ÖÓ³õÊ¼»¯2020/5/2/5/3:54/00¡£---//
//---´æ´¢Ë³ÐòÊÇÃë·ÖÊ±ÈÕÔÂÖÜÄê,´æ´¢¸ñÊ½ÊÇÓÃBCDÂë---//
uchar TIME[7] = {0, 0x57, 0x4, 0x02, 0x05, 0x05, 0x20};

//0000 0000=
//0000 0000=
//0001 0010=
//0000 0111=
//0000 0101=
//0001 0110=


/*******************************************************************************
* º¯ Êý Ãû         : Ds1302Write
* º¯Êý¹¦ÄÜ		   : ÏòDS1302ÃüÁî£¨µØÖ·+Êý¾Ý£©
* Êä    Èë         : addr,dat
* Êä    ³ö         : ÎÞ
*******************************************************************************/

void Ds1302Write(uchar addr, uchar dat)
{
	uchar n;
	RST = 0;
	_nop_();//ÑÓÊ±Ò»¸ö»úÆ÷ÖÜÆÚ 1us

	SCLK = 0;//ÏÈ½«SCLKÖÃµÍµçÆ½¡£
	_nop_();
	RST = 1; //È»ºó½«RST(CE)ÖÃ¸ßµçÆ½¡£
	_nop_();
	
	//¿ªÊ¼´«ËÍ°ËÎ»µØÖ·ÃüÁî
	for (n=0; n<8; n++)
	{
		DSIO = addr & 0x01;//Êý¾Ý´ÓµÍÎ»¿ªÊ¼´«ËÍ Ö»±£Áô×îºóÒ»Î»
		addr >>= 1;//µØÖ·Êý¾ÝÓÒÒÆÒ»Î» È¥³ý×îµÍÎ»
		SCLK = 1;//Êý¾ÝÔÚÉÏÉýÑØÊ±£¬DS1302¶ÁÈ¡Êý¾Ý
		_nop_();
		SCLK = 0;//Ê±ÖÓÏßÀ­µÍ ÎªÏÂÒ»´ÎµØÖ·¶ÁÈë×ö×¼±¸
		_nop_();
	}
	for (n=0; n<8; n++)
	{
		DSIO = dat & 0x01;//Êý¾Ý´ÓµÍÎ»¿ªÊ¼´«ËÍ Ö»±£Áô×îºóÒ»Î»
		dat >>= 1;//Êý¾ÝÓÒÒÆÒ»Î» È¥³ý×îµÍÎ»
		SCLK = 1;//Êý¾ÝÔÚÉÏÉýÑØÊ±£¬DS1302¶ÁÈ¡Êý¾Ý
		_nop_();
		SCLK = 0;//Ê±ÖÓÏßÀ­µÍÊý¾Ý·ÅÖÃÔÚio¿Ú ÎªÏÂÒ»´ÎµØÖ·¶ÁÈë×ö×¼±¸
		_nop_();	
	}	
	
	RST = 0;//´«ËÍÊý¾Ý½áÊø
	_nop_();
}

/*******************************************************************************
* º¯ Êý Ãû         : Ds1302Read
* º¯Êý¹¦ÄÜ		   	 : ¶ÁÈ¡Ò»¸öµØÖ·µÄÊý¾Ý
* Êä    Èë         : addr
* Êä    ³ö         : dat
*******************************************************************************/

uchar Ds1302Read(uchar addr)
{
	uchar n,dat,dat1;
	RST = 0;
	_nop_();

	SCLK = 0;//ÏÈ½«SCLKÖÃµÍµçÆ½¡£
	_nop_();
	RST = 1;//È»ºó½«RST(CE)ÖÃ¸ßµçÆ½¡£
	_nop_();

	for(n=0; n<8; n++)//¿ªÊ¼´«ËÍ°ËÎ»µØÖ·ÃüÁî
	{
		DSIO = addr & 0x01;//Êý¾Ý´ÓµÍÎ»¿ªÊ¼´«ËÍ
		addr >>= 1;
		SCLK = 1;//Êý¾ÝÔÚÉÏÉýÑØÊ±£¬DS1302¶ÁÈ¡Êý¾Ý
		_nop_();
		SCLK = 0;//DS1302ÏÂ½µÑØÊ±£¬·ÅÖÃÊý¾Ý
		_nop_();
	}
	_nop_();
	for(n=0; n<8; n++)//¶ÁÈ¡8Î»Êý¾Ý
	{
		dat1 = DSIO;//´Ó×îµÍÎ»¿ªÊ¼½ÓÊÕ
		dat = (dat>>1) | (dat1<<7);//Ã¿´ÎÖ»¶ÁÈ¡dat1×îºóÒ»Î»
		SCLK = 1;
		_nop_();
		SCLK = 0;//DS1302ÏÂ½µÑØÊ±£¬·ÅÖÃÊý¾Ý
		_nop_();
	}

	RST = 0;
	_nop_();	//ÒÔÏÂÎªDS1302¸´Î»µÄÎÈ¶¨Ê±¼ä,±ØÐëµÄ¡£
	SCLK = 1;
	_nop_();
	DSIO = 0;
	_nop_();
	DSIO = 1;
	_nop_();
	return dat;	
}

/*******************************************************************************
* º¯ Êý Ãû         : Ds1302Init
* º¯Êý¹¦ÄÜ		   : ³õÊ¼»¯DS1302.
* Êä    Èë         : ÎÞ
* Êä    ³ö         : ÎÞ
*******************************************************************************/

void Ds1302Init()
{
	uchar n;
	uchar flag;
	flag=Ds1302Read(0xc0);
	if(flag=0)
	{
		Ds1302Write(0xc0, 1);
		Ds1302Write(0x8E,0X00);		 //½ûÖ¹Ð´±£»¤£¬¾ÍÊÇ¹Ø±ÕÐ´±£»¤¹¦ÄÜ 8e=1 0 00111 0 wpÐ´±£»¤Î» 0->Î´Ð´±£»¤
		for (n=0; n<7; n++)//Ð´Èë7¸ö×Ö½ÚµÄÊ±ÖÓÐÅºÅ£º·ÖÃëÊ±ÈÕÔÂÖÜÄê
		{
		Ds1302Write(WRITE_RTC_ADDR[n],TIME[n]);	
		}
		Ds1302Write(0x8E,0x80);		 //´ò¿ªÐ´±£»¤¹¦Ü
	}

	
}

/*******************************************************************************
* º¯ Êý Ãû         : Ds1302ReadTime
* º¯Êý¹¦ÄÜ		     : ¶ÁÈ¡Ê±ÖÓÐÅÏ¢
* Êä    Èë         : ÎÞ
* Êä    ³ö         : ÎÞ
*******************************************************************************/

void Ds1302ReadTime()
{
	uchar n;
	for (n=0; n<7; n++)//¶ÁÈ¡7¸ö×Ö½ÚµÄÊ±ÖÓÐÅºÅ£ºÃë·ÖÊ±ÈÕÔÂÖÜÄê
	{
		TIME[n] = Ds1302Read(READ_RTC_ADDR[n]);
	}
		
} 


